app/.tests/20260516_113750/jmeter.log
2026-05-16 11:38:14,849 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-16 11:38:14,875 INFO o.a.j.JMeter: Loading user properties from: /opt/jmeter/bin/user.properties
2026-05-16 11:38:14,879 INFO o.a.j.JMeter: Loading system properties from: /opt/jmeter/bin/system.properties
2026-05-16 11:38:14,892 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-16 11:38:14,893 INFO o.a.j.JMeter: Version 5.6.3
2026-05-16 11:38:14,894 INFO o.a.j.JMeter: java.version=21.0.10
2026-05-16 11:38:14,894 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-16 11:38:14,894 INFO o.a.j.JMeter: os.name=Linux
2026-05-16 11:38:14,895 INFO o.a.j.JMeter: os.arch=amd64
2026-05-16 11:38:14,895 INFO o.a.j.JMeter: os.version=6.6.87.2-microsoft-standard-WSL2
2026-05-16 11:38:14,896 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-05-16 11:38:14,897 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-16 11:38:14,897 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-16 11:38:14,898 INFO o.a.j.JMeter: Available Processors =12
2026-05-16 11:38:14,911 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-16 11:38:14,911 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-16 11:38:14,918 INFO o.a.j.JMeter: JMeterHome=/opt/jmeter
2026-05-16 11:38:14,919 INFO o.a.j.JMeter: user.dir  =/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app
2026-05-16 11:38:14,919 INFO o.a.j.JMeter: PWD       =/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app
2026-05-16 11:38:14,920 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: Tabish FullName: Tabish.localdomain
2026-05-16 11:38:14,945 INFO o.a.j.s.FileServer: Default base='/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app'
2026-05-16 11:38:14,950 INFO o.a.j.s.FileServer: Set new base='/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app/./.tests/20260516_113750'
2026-05-16 11:38:15,189 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-16 11:38:15,230 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-16 11:38:15,234 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-16 11:38:15,240 INFO o.a.j.s.SaveService: Loading file: ./.tests/20260516_113750/test.jmx
2026-05-16 11:38:15,297 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 11:38:15,298 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 11:38:15,298 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 11:38:15,298 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 11:38:15,298 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-16 11:38:15,299 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-16 11:38:15,312 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-16 11:38:15,343 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-16 11:38:15,344 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 11:38:15,345 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 11:38:15,348 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-16 11:38:15,349 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-16 11:38:15,453 INFO o.a.j.JMeter: Running test (1778911695453)
2026-05-16 11:38:15,481 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users
2026-05-16 11:38:15,482 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Users.
2026-05-16 11:38:15,482 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-16 11:38:15,483 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=5 delayedStart=false
2026-05-16 11:38:15,490 INFO o.a.j.t.JMeterThread: Thread started: Users 1-1
2026-05-16 11:38:15,493 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-16 11:38:15,495 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-16 11:38:15,520 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Tabish
2026-05-16 11:38:15,531 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-16 11:38:15,533 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-16 11:38:15,533 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-16 11:38:15,534 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-16 11:38:15,534 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-16 11:38:15,698 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-05-16 11:38:15,714 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-05-16 11:38:15,715 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-05-16 11:38:15,988 INFO o.a.j.t.JMeterThread: Thread started: Users 1-2
2026-05-16 11:38:16,198 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-05-16 11:38:16,206 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-05-16 11:38:16,210 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-05-16 11:38:16,487 INFO o.a.j.t.JMeterThread: Thread started: Users 1-3
2026-05-16 11:38:16,985 INFO o.a.j.t.JMeterThread: Thread started: Users 1-4
2026-05-16 11:38:17,486 INFO o.a.j.t.JMeterThread: Thread started: Users 1-5
2026-05-16 11:38:17,724 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-1
2026-05-16 11:38:17,724 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-2
2026-05-16 11:38:17,727 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-1
2026-05-16 11:38:17,728 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-2
2026-05-16 11:38:17,986 INFO o.a.j.t.JMeterThread: Thread started: Users 1-6
2026-05-16 11:38:18,104 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-3
2026-05-16 11:38:18,105 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-3
2026-05-16 11:38:18,486 INFO o.a.j.t.JMeterThread: Thread started: Users 1-7
2026-05-16 11:38:18,811 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-4
2026-05-16 11:38:18,811 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-4
2026-05-16 11:38:18,985 INFO o.a.j.t.JMeterThread: Thread started: Users 1-8
2026-05-16 11:38:19,119 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-5
2026-05-16 11:38:19,120 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-5
2026-05-16 11:38:19,486 INFO o.a.j.t.JMeterThread: Thread started: Users 1-9
2026-05-16 11:38:19,629 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-6
2026-05-16 11:38:19,632 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-6
2026-05-16 11:38:19,985 INFO o.a.j.t.JMeterThread: Thread started: Users 1-10
2026-05-16 11:38:19,996 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-7
2026-05-16 11:38:19,997 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-7
2026-05-16 11:38:20,330 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-8
2026-05-16 11:38:20,335 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-8
2026-05-16 11:38:20,961 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-9
2026-05-16 11:38:20,962 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-9
2026-05-16 11:38:21,670 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-10
2026-05-16 11:38:21,671 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-10
2026-05-16 11:38:21,673 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-16 11:38:21,681 INFO o.a.j.r.Summariser: summary =     10 in 00:00:06 =    1.6/s Avg:  1652 Min:  1339 Max:  2096 Err:     0 (0.00%)