app/.tests/20260516_121212/jmeter.log
2026-05-16 12:12:21,558 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-16 12:12:21,591 INFO o.a.j.JMeter: Loading user properties from: /opt/jmeter/bin/user.properties
2026-05-16 12:12:21,592 INFO o.a.j.JMeter: Loading system properties from: /opt/jmeter/bin/system.properties
2026-05-16 12:12:21,605 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-16 12:12:21,606 INFO o.a.j.JMeter: Version 5.6.3
2026-05-16 12:12:21,606 INFO o.a.j.JMeter: java.version=21.0.10
2026-05-16 12:12:21,606 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-16 12:12:21,607 INFO o.a.j.JMeter: os.name=Linux
2026-05-16 12:12:21,607 INFO o.a.j.JMeter: os.arch=amd64
2026-05-16 12:12:21,607 INFO o.a.j.JMeter: os.version=6.6.87.2-microsoft-standard-WSL2
2026-05-16 12:12:21,608 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-05-16 12:12:21,608 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-16 12:12:21,609 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-16 12:12:21,609 INFO o.a.j.JMeter: Available Processors =12
2026-05-16 12:12:21,622 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-16 12:12:21,622 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-16 12:12:21,623 INFO o.a.j.JMeter: JMeterHome=/opt/jmeter
2026-05-16 12:12:21,624 INFO o.a.j.JMeter: user.dir  =/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app
2026-05-16 12:12:21,624 INFO o.a.j.JMeter: PWD       =/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app
2026-05-16 12:12:21,625 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: Tabish FullName: Tabish.localdomain
2026-05-16 12:12:21,654 INFO o.a.j.s.FileServer: Default base='/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app'
2026-05-16 12:12:21,658 INFO o.a.j.s.FileServer: Set new base='/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app/./.tests/20260516_121212'
2026-05-16 12:12:21,910 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-16 12:12:21,959 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-16 12:12:21,964 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-16 12:12:21,969 INFO o.a.j.s.SaveService: Loading file: ./.tests/20260516_121212/test.jmx
2026-05-16 12:12:22,033 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 12:12:22,033 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 12:12:22,034 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 12:12:22,034 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 12:12:22,035 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-16 12:12:22,035 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-16 12:12:22,049 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-16 12:12:22,078 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-16 12:12:22,079 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 12:12:22,080 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 12:12:22,084 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-16 12:12:22,085 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-16 12:12:22,220 INFO o.a.j.JMeter: Running test (1778913742220)
2026-05-16 12:12:22,250 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users
2026-05-16 12:12:22,251 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Users.
2026-05-16 12:12:22,252 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-16 12:12:22,253 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=5 delayedStart=false
2026-05-16 12:12:22,260 INFO o.a.j.t.JMeterThread: Thread started: Users 1-1
2026-05-16 12:12:22,264 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-16 12:12:22,265 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-16 12:12:22,288 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Tabish
2026-05-16 12:12:22,299 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-16 12:12:22,302 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-16 12:12:22,303 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-16 12:12:22,304 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-16 12:12:22,304 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-16 12:12:22,443 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-05-16 12:12:22,458 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-05-16 12:12:22,459 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-05-16 12:12:22,758 INFO o.a.j.t.JMeterThread: Thread started: Users 1-2
2026-05-16 12:12:23,025 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-05-16 12:12:23,034 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-05-16 12:12:23,035 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-05-16 12:12:23,256 INFO o.a.j.t.JMeterThread: Thread started: Users 1-3
2026-05-16 12:12:23,755 INFO o.a.j.t.JMeterThread: Thread started: Users 1-4
2026-05-16 12:12:24,255 INFO o.a.j.t.JMeterThread: Thread started: Users 1-5
2026-05-16 12:12:24,755 INFO o.a.j.t.JMeterThread: Thread started: Users 1-6
2026-05-16 12:12:25,255 INFO o.a.j.t.JMeterThread: Thread started: Users 1-7
2026-05-16 12:12:25,755 INFO o.a.j.t.JMeterThread: Thread started: Users 1-8
2026-05-16 12:12:26,254 INFO o.a.j.t.JMeterThread: Thread started: Users 1-9
2026-05-16 12:12:26,754 INFO o.a.j.t.JMeterThread: Thread started: Users 1-10
2026-05-16 12:12:30,161 INFO o.a.j.r.Summariser: summary +     85 in 00:00:08 =   10.7/s Avg:   620 Min:   322 Max:  2261 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-05-16 12:12:37,284 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-1
2026-05-16 12:12:37,286 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-1
2026-05-16 12:12:37,351 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-3
2026-05-16 12:12:37,352 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-3
2026-05-16 12:12:37,447 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-4
2026-05-16 12:12:37,447 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-4
2026-05-16 12:12:37,485 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-10
2026-05-16 12:12:37,487 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-10
2026-05-16 12:12:37,515 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-2
2026-05-16 12:12:37,516 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-2
2026-05-16 12:12:37,631 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-6
2026-05-16 12:12:37,632 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-6
2026-05-16 12:12:37,995 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-8
2026-05-16 12:12:37,996 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-8
2026-05-16 12:12:38,072 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-9
2026-05-16 12:12:38,073 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-9
2026-05-16 12:12:41,521 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-5
2026-05-16 12:12:41,522 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-5
2026-05-16 12:12:43,116 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-7
2026-05-16 12:12:43,117 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-7
2026-05-16 12:12:43,119 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-16 12:12:43,124 INFO o.a.j.r.Summariser: summary +    114 in 00:00:13 =    8.8/s Avg:   765 Min:   318 Max: 11225 Err:     1 (0.88%) Active: 0 Started: 10 Finished: 10
2026-05-16 12:12:43,126 INFO o.a.j.r.Summariser: summary =    199 in 00:00:21 =    9.5/s Avg:   703 Min:   318 Max: 11225 Err:     1 (0.50%)