app/.tests/20260516_124657/jmeter.log
2026-05-16 12:47:07,439 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-16 12:47:07,476 INFO o.a.j.JMeter: Loading user properties from: /opt/jmeter/bin/user.properties
2026-05-16 12:47:07,478 INFO o.a.j.JMeter: Loading system properties from: /opt/jmeter/bin/system.properties
2026-05-16 12:47:07,494 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-16 12:47:07,495 INFO o.a.j.JMeter: Version 5.6.3
2026-05-16 12:47:07,495 INFO o.a.j.JMeter: java.version=21.0.10
2026-05-16 12:47:07,496 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-16 12:47:07,496 INFO o.a.j.JMeter: os.name=Linux
2026-05-16 12:47:07,497 INFO o.a.j.JMeter: os.arch=amd64
2026-05-16 12:47:07,498 INFO o.a.j.JMeter: os.version=6.6.87.2-microsoft-standard-WSL2
2026-05-16 12:47:07,498 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-05-16 12:47:07,499 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-16 12:47:07,499 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-16 12:47:07,500 INFO o.a.j.JMeter: Available Processors =12
2026-05-16 12:47:07,517 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-16 12:47:07,518 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-16 12:47:07,519 INFO o.a.j.JMeter: JMeterHome=/opt/jmeter
2026-05-16 12:47:07,519 INFO o.a.j.JMeter: user.dir  =/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app
2026-05-16 12:47:07,520 INFO o.a.j.JMeter: PWD       =/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app
2026-05-16 12:47:07,520 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: Tabish FullName: Tabish.localdomain
2026-05-16 12:47:07,544 INFO o.a.j.s.FileServer: Default base='/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app'
2026-05-16 12:47:07,548 INFO o.a.j.s.FileServer: Set new base='/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/Team_Kiwi/app/./.tests/20260516_124657'
2026-05-16 12:47:07,788 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-16 12:47:07,826 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-16 12:47:07,830 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-16 12:47:07,835 INFO o.a.j.s.SaveService: Loading file: ./.tests/20260516_124657/test.jmx
2026-05-16 12:47:07,897 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 12:47:07,898 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 12:47:07,898 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 12:47:07,899 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 12:47:07,899 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-16 12:47:07,900 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-16 12:47:07,914 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-16 12:47:07,944 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-16 12:47:07,946 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 12:47:07,946 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 12:47:07,950 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-16 12:47:07,952 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-16 12:47:08,054 INFO o.a.j.JMeter: Running test (1778915828054)
2026-05-16 12:47:08,085 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users
2026-05-16 12:47:08,086 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Users.
2026-05-16 12:47:08,086 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-16 12:47:08,087 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=5 delayedStart=false
2026-05-16 12:47:08,095 INFO o.a.j.t.JMeterThread: Thread started: Users 1-1
2026-05-16 12:47:08,097 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-16 12:47:08,099 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-16 12:47:08,124 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Tabish
2026-05-16 12:47:08,134 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-16 12:47:08,137 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-16 12:47:08,138 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-16 12:47:08,138 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-16 12:47:08,139 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-16 12:47:08,283 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-05-16 12:47:08,299 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-05-16 12:47:08,300 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-05-16 12:47:08,594 INFO o.a.j.t.JMeterThread: Thread started: Users 1-2
2026-05-16 12:47:08,735 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-05-16 12:47:08,743 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-05-16 12:47:08,743 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-05-16 12:47:09,092 INFO o.a.j.t.JMeterThread: Thread started: Users 1-3
2026-05-16 12:47:09,591 INFO o.a.j.t.JMeterThread: Thread started: Users 1-4
2026-05-16 12:47:10,090 INFO o.a.j.t.JMeterThread: Thread started: Users 1-5
2026-05-16 12:47:10,590 INFO o.a.j.t.JMeterThread: Thread started: Users 1-6
2026-05-16 12:47:11,089 INFO o.a.j.t.JMeterThread: Thread started: Users 1-7
2026-05-16 12:47:11,589 INFO o.a.j.t.JMeterThread: Thread started: Users 1-8
2026-05-16 12:47:12,090 INFO o.a.j.t.JMeterThread: Thread started: Users 1-9
2026-05-16 12:47:12,590 INFO o.a.j.t.JMeterThread: Thread started: Users 1-10
2026-05-16 12:47:23,206 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-3
2026-05-16 12:47:23,207 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-3
2026-05-16 12:47:23,224 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-10
2026-05-16 12:47:23,226 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-10
2026-05-16 12:47:23,227 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-5
2026-05-16 12:47:23,228 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-5
2026-05-16 12:47:23,279 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-4
2026-05-16 12:47:23,280 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-4
2026-05-16 12:47:23,353 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-1
2026-05-16 12:47:23,355 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-1
2026-05-16 12:47:23,391 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-2
2026-05-16 12:47:23,393 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-2
2026-05-16 12:47:23,601 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-7
2026-05-16 12:47:23,602 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-7
2026-05-16 12:47:23,672 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-9
2026-05-16 12:47:23,673 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-9
2026-05-16 12:47:23,838 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-6
2026-05-16 12:47:23,839 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-6
2026-05-16 12:47:24,140 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-8
2026-05-16 12:47:24,141 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-8
2026-05-16 12:47:24,143 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-16 12:47:24,169 INFO o.a.j.r.Summariser: summary =    173 in 00:00:16 =   10.7/s Avg:   758 Min:   288 Max:  2682 Err:     1 (0.58%)